src/DataProcessors/СхемаПроцессаВозвратовОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СхемаПроцессаВозвратовОтПокупателя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ПараметрыЭтаповСхемыПроцессаВозвратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыЭтаповСхемыПроцессаВозвратов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лево</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Верх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/СхемаПроцессаВозвратовОтПокупателя/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВозвратыНаСервере()
	
	ТочечнаяЛиния=новый Линия(ТипСоединительнойЛинии.Точечная,1);
	
	ГрафСхемаXDTO=СериализаторXDTO.ЗаписатьXDTO(ГрафСхема);
	
	ГрафСхемаXDTO.item.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус.Код КАК Код,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус КАК Этап,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус.Наименование КАК Имя,
	|	ЕСТЬNULL(ПараметрыЭтаповСхемыПроцессаВозвратов.Лево, 1) КАК Лево,
	|	ЕСТЬNULL(ПараметрыЭтаповСхемыПроцессаВозвратов.Верх, 1) КАК Верх
	|ИЗ
	|	Справочник.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя КАК ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЭтаповСхемыПроцессаВозвратов КАК ПараметрыЭтаповСхемыПроцессаВозвратов
	|		ПО (ПараметрыЭтаповСхемыПроцессаВозвратов.Объект = ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус)
	|ГДЕ
	|	не ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус.Код,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус.Наименование,
	|	ЕСТЬNULL(ПараметрыЭтаповСхемыПроцессаВозвратов.Лево, 1),
	|	ЕСТЬNULL(ПараметрыЭтаповСхемыПроцессаВозвратов.Верх, 1)
	|ИЗ
	|	Справочник.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя КАК ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЭтаповСхемыПроцессаВозвратов КАК ПараметрыЭтаповСхемыПроцессаВозвратов
	|		ПО (ПараметрыЭтаповСхемыПроцессаВозвратов.Объект = ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус)
	|ГДЕ
	|	не ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.СтатусыДокументов.АктРассмотренияВозврата);
	РезультатЗапроса = Запрос.Выполнить();
	Вершины = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка.Автоматически КАК Автоматически,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус.Код КАК Код1,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус КАК Этап1,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус.Наименование КАК Имя1,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус.Код КАК Код2,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус КАК Этап2,
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус.Наименование КАК Имя2,
	|	ЕСТЬNULL(ПараметрыЭтаповСхемыПроцессаВозвратов.Направление1, 4) КАК Направление1,
	|	ЕСТЬNULL(ПараметрыЭтаповСхемыПроцессаВозвратов.Направление2, 2) КАК Направление2
	|ИЗ
	|	Справочник.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя КАК ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЭтаповСхемыПроцессаВозвратов КАК ПараметрыЭтаповСхемыПроцессаВозвратов
	|		ПО (ПараметрыЭтаповСхемыПроцессаВозвратов.Объект = ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка)
	|ГДЕ
	|	НЕ ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Ребра = РезультатЗапроса.Выгрузить();
	
	ИдентификаторыЭтапов = Новый Структура;
	Для Каждого Вершина Из Вершины Цикл
		
		НовОбъект=РаботаСГС.НовыйОбъектОбработка(ГрафСхемаXDTO,Вершина.Имя,Вершина.Имя,Вершина.Лево,Вершина.Верх,100,60);
		ГрафСхемаXDTO.item.Добавить(НовОбъект);
		
		ИдентификаторыЭтапов.Вставить("_"+НовОбъект.itemId, Вершина.Этап);
	КонецЦикла;
	
	Для Каждого Ребро Из Ребра Цикл
		
		ЗаголовокЛинии = ?(Ребро.Автоматически, "{А}", Неопределено);
		
		НовОбъект = РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,Ребро.Имя1,Ребро.Имя2,Ребро.Направление1,Ребро.Направление2,,,,,,ЗаголовокЛинии);
		ИдентификаторыЭтапов.Вставить("_"+НовОбъект.itemId, Ребро.Ссылка);
		
	КонецЦикла;
	
	ГрафСхема=СериализаторXDTO.ПрочитатьXDTO(ГрафСхемаXDTO);
	
	ГрафСхема.ИспользоватьСетку = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Возвраты(Команда)
	ВозвратыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафСхемаВыбор(Элемент)
	
	ГрафСхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(ГрафСхема);
	
	ОбъектСхемы = РаботаСГС.НайтиОбъектСхемы(ГрафСхемаXDTO, Элемент.ТекущийЭлемент.Имя);
	
	Если ОбъектСхемы <> Неопределено Тогда
		
		Этап = Неопределено; 
		Если ИдентификаторыЭтапов.Свойство("_"+ОбъектСхемы.itemId, Этап) Тогда
			ОткрытьЗначение(Этап);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	ГрафСхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(ГрафСхема);

	Для каждого ЭЛГС ИЗ ГрафСхема.ЭлементыГрафическойСхемы Цикл
		
		ОбъектСхемы = РаботаСГС.НайтиОбъектСхемы(ГрафСхемаXDTO, ЭЛГС.Имя);
		
		Этап = Неопределено;
		Если ИдентификаторыЭтапов.Свойство("_"+ОбъектСхемы.itemId, Этап) Тогда
			
			Если ТипЗнч(ЭЛГС) = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния") Тогда
				
				РегистрыСведений.ПараметрыЭтаповСхемыПроцессаВозвратов.Добавить(
				Этап,  Новый Структура("Направление1,Направление2",ОбъектСхемы.portIndexFrom, ОбъектСхемы.portIndexTo));	
				
			Иначе
				РегистрыСведений.ПараметрыЭтаповСхемыПроцессаВозвратов.Добавить(
				Этап,  Новый Структура("Лево,Верх",ЭЛГС.Лево, ЭЛГС.Верх));	
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
КонецПроцедуры


//Примеры  

&НаКлиенте
Процедура Удалить(Команда)
	
	
	Если Элементы.ГрафСхема.ТекущийЭлемент<>Неопределено  Тогда   
	    ГрафСхемаXDTO=СериализаторXDTO.ЗаписатьXDTO(ГрафСхема);
		
		Список=ГрафСхемаXDTO.item;
		Для каждого эл Из ГрафСхемаXDTO.item Цикл   
			
			Если Элементы.ГрафСхема.ТекущийЭлемент.Имя=эл.itemCode Тогда   
				РаботаСГС.УдалитьОбъектСхемы(ГрафСхемаXDTO,эл.itemCode);
			КонецЕсли; 
		КонецЦикла; 
		ГрафСхема=СериализаторXDTO.ПрочитатьXDTO(ГрафСхемаXDTO);
		
	КонецЕсли; 


КонецПроцедуры

&НаКлиенте
Процедура Пример(Команда)
	
	ТочечнаяЛиния=новый Линия(ТипСоединительнойЛинии.Точечная,1);
	
	ГрафСхемаXDTO=СериализаторXDTO.ЗаписатьXDTO(ГрафСхема);
	
	ГрафСхемаXDTO.item.Очистить();
	
	НовОбъект=РаботаСГС.НовыйОбъектСтарт(ГрафСхемаXDTO,"Старт"," ",100,20,80,60,WebЦвета.Золотой);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);
	
	НовОбъект=РаботаСГС.НовыйОбъектУсловие(ГрафСхемаXDTO,"Шестиугольник",,100,120,80,40,,ТочечнаяЛиния);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);	
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Старт","Шестиугольник",4,2,,,ТочечнаяЛиния);
	
	НовОбъект=РаботаСГС.НовыйОбъектДействие(ГрафСхемаXDTO,"Действие1",,240,40,80,60,WebЦвета.БледноБирюзовый);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Шестиугольник","Действие1",3,1,,,новый Линия(ТипСоединительнойЛинии.ПунктирТочкаТочка,1));
	
	НовОбъект=РаботаСГС.НовыйОбъектОбработка(ГрафСхемаXDTO,"Обработка1",,240,140,80,60);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Шестиугольник","Обработка1",4,1);
	
	НовОбъект=РаботаСГС.НовыйОбъектДекорация(ГрафСхемаXDTO,"Декорация","Входящие",ФигурыГрафическойСхемы.Папка,10,60,80,40);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);	
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Декорация","Шестиугольник",4,1,,,ТочечнаяЛиния,,СтильСтрелки.Нет);
	
	НовОбъект=РаботаСГС.НовыйОбъектРазделение(ГрафСхемаXDTO,"Треугольник1","",200,240,20,60,WebЦвета.Древесный);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);	
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Обработка1","Треугольник1",4,2);
	
	НовОбъект=РаботаСГС.НовыйОбъектСлияние(ГрафСхемаXDTO,"Треугольник2","",200,300,20,60,WebЦвета.Древесный);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);	
	
	НовОбъект=РаботаСГС.НовыйОбъектДекорация(ГрафСхемаXDTO,"Декорация2","Это фигуры слияния и разделения",ФигурыГрафическойСхемы.СтрелкаВправо,10,260,180,80,WebЦвета.СветлоЖелтый);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);	
	
	НовОбъект=РаботаСГС.НовыйОбъектВложенныйПроцесс(ГрафСхемаXDTO,"Процесс",,100,440,100,60);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Треугольник2","Процесс",4,1);
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Шестиугольник","Процесс",4,2);
	
	
	НовОбъект=РаботаСГС.НовыйОбъектВыборВарианта(ГрафСхемаXDTO,"Светофор",,260,400,100,60,WebЦвета.СветлоСерый);
	РаботаСГС.ДобавитьВариант(НовОбъект,"Красный","",WebЦвета.Красный);
	РаботаСГС.ДобавитьВариант(НовОбъект,"Желтый","",WebЦвета.Желтый);
	РаботаСГС.ДобавитьВариант(НовОбъект,"Зеленый","",WebЦвета.Зеленый);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);
	
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Процесс","Светофор",3,1,,1);
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Обработка1","Светофор",3,2,,,ТочечнаяЛиния,СтильСтрелки.Незаполненная,СтильСтрелки.Незаполненная);
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Светофор","Светофор",1,3,3,3);
	
	
	НовОбъект=РаботаСГС.НовыйОбъектДекорация(ГрафСхемаXDTO,"Декорация3","Линия может входить и выходить с любой стороны варианта",ФигурыГрафическойСхемы.СтрелкаВлево,380,480,220,80,WebЦвета.СветлоЖелтый);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);
	
	НовОбъект=РаботаСГС.НовыйОбъектДекорация(ГрафСхемаXDTO,"Декорация4","Соединительные линии и стрелки могут быть разных типов",ФигурыГрафическойСхемы.СтрелкаВлево,340,280,220,80,WebЦвета.СветлоЖелтый);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);
	
	
	НовОбъект=РаботаСГС.НовыйОбъектДекорация(ГрафСхемаXDTO,"Декорация5","В фигуру могут входить и выходить несколько линий с любой стороны",ФигурыГрафическойСхемы.СтрелкаВлево,340,80,220,80,WebЦвета.СветлоЖелтый);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);	
	
	
	НовОбъект=РаботаСГС.НовыйОбъектДекорация(ГрафСхемаXDTO,"Декорация6","Пример работы с объектами графической схемы
	|
	|Схема может использоваться не только для построения маршрута бизнес-процесса, но и для иллюстрации схем, структур подчиненности, ER-диаграмм и т.п.
	|",ФигурыГрафическойСхемы.СкобкиГоризонтальные,600,80,200,200);
	ГрафСхемаXDTO.item.Добавить(НовОбъект);	

	
	РаботаСГС.СоединитьОбъектыЛинией(ГрафСхемаXDTO,"Светофор","Декорация6",3,4,2,0);
	
	
	ГрафСхема=СериализаторXDTO.ПрочитатьXDTO(ГрафСхемаXDTO);

	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВариант(Команда)
Если Элементы.ГрафСхема.ТекущийЭлемент<>Неопределено  Тогда   
	    ГрафСхемаXDTO=СериализаторXDTO.ЗаписатьXDTO(ГрафСхема);
		
		Список=ГрафСхемаXDTO.item;
		Для каждого эл Из ГрафСхемаXDTO.item Цикл   
			
			Если Элементы.ГрафСхема.ТекущийЭлемент.Имя=эл.itemCode Тогда   
				Если эл.itemType=КонстантыГС.ТипОбъектаВыборВарианта() Тогда   
					РаботаСГС.ВставитьВариант(ГрафСхемаXDTO,эл,0,"Вариант");
				КонецЕсли; 
				
			КонецЕсли; 
		КонецЦикла; 
		ГрафСхема=СериализаторXDTO.ПрочитатьXDTO(ГрафСхемаXDTO);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВариант(Команда)
	Если Элементы.ГрафСхема.ТекущийЭлемент<>Неопределено  Тогда   
	    ГрафСхемаXDTO=СериализаторXDTO.ЗаписатьXDTO(ГрафСхема);
		
		Список=ГрафСхемаXDTO.item;
		Для каждого эл Из ГрафСхемаXDTO.item Цикл   
			
			Если Элементы.ГрафСхема.ТекущийЭлемент.Имя=эл.itemCode Тогда   
				Если эл.itemType=КонстантыГС.ТипОбъектаВыборВарианта() Тогда   
					РаботаСГС.УдалитьВариант(ГрафСхемаXDTO,эл,0);
				КонецЕсли; 
				
			КонецЕсли; 
		КонецЦикла; 
		ГрафСхема=СериализаторXDTO.ПрочитатьXDTO(ГрафСхемаXDTO);
		
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ВозвратыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
